<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Диск, используемый для хранения файлов
    |--------------------------------------------------------------------------
    */

    'disk' => env('TUBE_STORAGE_DISK', null),

    /*
    |--------------------------------------------------------------------------
    | Подключение клиента через прокси
    |--------------------------------------------------------------------------
    */

    'proxy' => [
        'url' => env('TUBE_PROXY_URL'),
        'port' => env('TUBE_PROXY_PORT', 3128),
        'user' => env('TUBE_PROXY_USER'),
        'password' => env('TUBE_PROXY_PASSWORD'),
    ],

];
